packages/utils/src/terminology/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 30
  http:
    headers:
      Content-Type: 'application/json'
  processor: ./codes.ts

scenarios:

  - name: "lookupCode"
    weight: 1
    flow:
      - function: "lookupCode"

  - name: "translateCode"
    weight: 1
    flow:
      - function: "translateCode"